<section class="w-full bg-white">
    <div class="w-full h-[70px] lg:h-[100px] flex items-center justify-between max-w-7xl mx-auto px-4"
        x-data="{ open: false }">
        <a href="{{ route('home') }}" class="flex justify-center items-center lg:space-x-2 xl:space-x-4 md:space-x-4 md:ml-4 lg:ml-1 xl:ml-4">
            <img src="{{ asset('assets/logo/logo-image.png') }}" alt="" class="w-[50px] xl:w-[100px] md:w-[50px] sm:w-[70px] lg:ml-16 md:ml-20 sm:ml-12 ml-0 py-2">
            <img src="{{ asset('assets/logo/logo-text.png') }}" alt="" class="w-[125px] xl:w-[280px] lg:w-[180px] md:w-[240px] sm:w-[200px] lg:ml-16 md:ml-20 sm:ml-12 ml-0 py-2">
        </a>
        <div class="hidden lg:flex items-center gap-2">
            <div class="flex items-center space-x-2">
                <a href="#" class="flex items-center gap-2 text-[12px] text-[#1E1E1E] text-decoration-none">
                    <svg width="14" height="15" viewBox="0 0 14 15" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M6.56687 10.6981C6.62635 10.8591 6.60873 11.0417 6.52005 11.1853C6.43082 11.3295 6.28266 11.4155 6.12349 11.4155H4.94978H3.77553C3.61635 11.4155 3.46819 11.3289 3.37897 11.1853C3.29029 11.0417 3.27267 10.8591 3.33215 10.6981C3.53429 10.1525 3.92314 9.62795 4.48823 9.14067L4.65347 8.99827C4.82751 8.84805 5.07481 8.84865 5.24831 8.99947L5.41023 9.14067C5.97588 9.63096 6.36528 10.1549 6.56687 10.6981ZM9.2822 12.0307C8.90712 11.7477 8.39269 11.8487 8.13273 12.2591C7.99007 12.4838 7.75654 12.6172 7.50759 12.6172H2.40574C2.18488 12.6172 1.97504 12.5114 1.82963 12.3282C1.74867 12.2248 1.61758 12.0055 1.65999 11.6985C1.8456 10.3502 2.62165 9.07818 3.96665 7.91674C4.16438 7.7455 4.28004 7.48534 4.28004 7.21015C4.28004 6.93496 4.16438 6.67419 3.96665 6.50355C2.62165 5.34212 1.84505 4.06953 1.65999 2.72123C1.61758 2.4142 1.74812 2.19549 1.82963 2.09215C1.97504 1.90829 2.18488 1.80314 2.40574 1.80314H7.50814C7.72846 1.80314 7.9383 1.90769 8.08316 2.09094C8.38058 2.46707 8.90161 2.50973 9.24805 2.18468C9.59394 1.85962 9.63194 1.29062 9.33397 0.913286C8.87517 0.332869 8.20928 8.09101e-07 7.50814 8.09101e-07H2.40574C1.7035 -0.000600037 1.03706 0.33347 0.577714 0.915089C0.124975 1.4889 -0.0766099 2.24476 0.0263855 2.98861C0.236782 4.51596 0.96491 5.93215 2.19424 7.20955C0.96491 8.48695 0.236782 9.90314 0.0263855 11.4305C-0.0766099 12.1743 0.124975 12.9302 0.577714 13.504C1.03706 14.0862 1.7035 14.4197 2.40574 14.4197H7.50814C8.29961 14.4197 9.04096 13.9955 9.49204 13.2847C9.75201 12.8755 9.65783 12.3137 9.2822 12.0307ZM13.2181 7.20955C13.2181 9.20075 11.7387 10.8146 9.91339 10.8146C8.08811 10.8146 6.60872 9.20075 6.60872 7.20955C6.60872 5.21835 8.08811 3.60447 9.91339 3.60447C11.7387 3.60447 13.2181 5.21835 13.2181 7.20955ZM11.2903 7.86207L10.4642 6.9608V5.40701C10.4642 5.07534 10.2174 4.80617 9.91339 4.80617C9.60936 4.80617 9.36261 5.07534 9.36261 5.40701V6.9608C9.36261 7.27925 9.47883 7.58508 9.68537 7.81039L10.5115 8.71166C10.7269 8.94599 11.0755 8.94599 11.2903 8.71166C11.5057 8.47673 11.5057 8.0964 11.2903 7.86207Z"
                            fill="#109A49" />
                    </svg>
                    <span>
                        {{-- {{ $locale === 'km' ? 'ច័ន្ទ សុក្រ ៨ព្រឹក ៥ល្ងាច ' : ($locale === 'cn' ? 'Monday - Friday 8am - 5pm' : '星期一至五 8am - 5pm') }} --}}
                        {{ app()->getLocale() === 'en' ? 'Monday - Friday 8am - 5pm' : (app()->getLocale() === 'km' ? 'ច័ន្ទ សុក្រ ៨ព្រឹក ៥ល្ងាច' : '星期一至五 8am - 5pm') }}<br>
                        {{ app()->getLocale() === 'en' ? 'Saturday 8am - 12pm' : (app()->getLocale() === 'km' ? 'ថ្ងៃសៅរ៍ ម៉ោង៨ព្រឹក ដល់ម៉ោង១២រសៀល' : '星期一至五 8am - 5pm') }}
                    </span>
                </a>
                <a href="https://mail.google.com/mail/?view=cm&fs=1&to=info@rsltrading.com" target="_blank" class="flex items-center gap-2 text-[12px] text-[#1E1E1E] text-decoration-none">
                    <svg width="16" height="15" viewBox="0 0 16 15" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M12.0414 0H3.57989C2.63076 0.00104095 1.7208 0.381179 1.04967 1.05701C0.378532 1.73284 0.00103372 2.64916 0 3.60492L0 10.8148C0.00103372 11.7705 0.378532 12.6869 1.04967 13.3627C1.7208 14.0385 2.63076 14.4187 3.57989 14.4197H12.0414C12.9906 14.4187 13.9005 14.0385 14.5717 13.3627C15.2428 12.6869 15.6203 11.7705 15.6213 10.8148V3.60492C15.6203 2.64916 15.2428 1.73284 14.5717 1.05701C13.9005 0.381179 12.9906 0.00104095 12.0414 0ZM12.0414 1.96632C12.4362 1.96765 12.8167 2.11481 13.1109 2.3799L8.88008 6.64027C8.59272 6.91664 8.21064 7.07086 7.81327 7.07086C7.4159 7.07086 7.03382 6.91664 6.74646 6.64027L2.51569 2.3799C2.80849 2.11601 3.18695 1.96892 3.57989 1.96632H12.0414ZM12.0414 12.4534H3.57989C3.14832 12.4534 2.73443 12.2807 2.42927 11.9734C2.12411 11.6661 1.95267 11.2494 1.95267 10.8148V4.59923L5.36268 8.03308C5.68406 8.35685 6.06564 8.61369 6.48562 8.78892C6.90559 8.96415 7.35574 9.05434 7.81034 9.05434C8.26494 9.05434 8.71509 8.96415 9.13507 8.78892C9.55505 8.61369 9.93663 8.35685 10.258 8.03308L13.6687 4.59923V10.8148C13.6687 11.2494 13.4972 11.6661 13.1921 11.9734C12.8869 12.2807 12.473 12.4534 12.0414 12.4534Z"
                            fill="#109A49" />
                    </svg>

                    <span>{{ app()->getLocale() === 'en' ? 'info@rsltrading.com' : (app()->getLocale() === 'km' ? 'អ៉ីមែល៖ info@rsltrading.com' : 'info@rsltrading.com') }}</span>
                </a>
                <a href="#" class="flex items-center gap-2 text-[12px] text-[#1E1E1E] text-decoration-none">
                    <svg width="15" height="15" viewBox="0 0 16 16" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M14.4232 1.25362L13.7134 0.63544C12.8213 -0.2235 11.3953 -0.216993 10.4902 0.687497L9.14229 2.14509C8.71253 2.57456 8.4716 3.14719 8.4716 3.75886C8.4716 4.37053 8.70601 4.93665 9.13578 5.36612L9.39624 5.6264C8.56927 7.37031 7.33207 8.60666 5.64556 9.38751L5.37859 9.12723C4.94882 8.69776 4.3758 8.4635 3.77022 8.4635C3.16464 8.4635 2.59162 8.69776 2.18139 9.10771L0.670695 10.5067C0.240929 10.9362 0 11.5088 0 12.1205C0 12.7322 0.227906 13.2788 0.638137 13.7017C0.638137 13.7017 1.24372 14.398 1.25674 14.411C2.03813 15.1919 3.09301 15.6213 4.22603 15.6213C9.12276 15.6213 15.6213 9.12723 15.6213 4.23388C15.6213 3.10164 15.1916 2.04748 14.4102 1.26663L14.4232 1.25362ZM4.23905 13.6562C3.63999 13.6562 3.07999 13.4349 2.66976 13.038C2.66976 13.038 2.07069 12.3483 2.05116 12.3352C1.9665 12.2506 1.95348 12.153 1.95348 12.1075C1.95348 12.0619 1.9665 11.9578 2.02511 11.9058L3.5358 10.5067C3.62045 10.4221 3.71813 10.4091 3.76371 10.4091C3.80929 10.4091 3.91347 10.4221 3.99161 10.5067L4.72742 11.2355C5.00091 11.5023 5.40463 11.5869 5.76277 11.4503C8.43253 10.4352 10.3469 8.52207 11.4474 5.77606C11.5907 5.41817 11.5125 5.00172 11.239 4.72842L10.5097 3.98661C10.4251 3.90201 10.4121 3.80441 10.4121 3.75886C10.4121 3.71331 10.4251 3.60919 10.5358 3.50508L11.8837 2.04748C12.0139 1.92385 12.2158 1.92385 12.346 2.04748C12.359 2.0605 13.0493 2.66566 13.0493 2.66566C13.4465 3.07561 13.6679 3.62871 13.6679 4.23388C13.6679 8.39843 7.81392 13.6692 4.22603 13.6692L4.23905 13.6562Z"
                            fill="#109A49" />
                    </svg>

                    <span>{{ app()->getLocale() === 'en' ? '+855 11 678 588' : (app()->getLocale() === 'km' ? 'លេខទូរស័ព្ទ៖ +៨៥៥ ១១ ៦៧៨ ៥៨៨' : '+855 11 678 588') }}</span>
                </a>

                {{-- social media --}}
                <a href="https://www.facebook.com/rsltradingcambodia" target="_blank" class="ml-4">
                    <svg width="27" height="27" viewBox="0 0 27 27" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M13.1165 0C5.88409 0 0 5.88409 0 13.1165C0 20.3484 5.88409 26.233 13.1165 26.233C20.3484 26.233 26.233 20.3484 26.233 13.1165C26.233 5.88409 20.3494 0 13.1165 0ZM16.3784 13.5783H14.2445V21.1842H11.0824C11.0824 21.1842 11.0824 17.0283 11.0824 13.5783H9.57928V10.8901H11.0824V9.15132C11.0824 7.90603 11.6741 5.96017 14.2736 5.96017L16.6167 5.96915V8.57861C16.6167 8.57861 15.1929 8.57861 14.916 8.57861C14.6392 8.57861 14.2455 8.71703 14.2455 9.31088V10.8906H16.6548L16.3784 13.5783Z"
                            fill="#007BFF" />
                    </svg>
                </a>    
                <a href="https://t.me/+85511678588" target="_blank">
                    <svg width="27" height="27" viewBox="0 0 27 27" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M13.1165 26.233C20.3605 26.233 26.233 20.3605 26.233 13.1165C26.233 5.87245 20.3605 0 13.1165 0C5.87245 0 0 5.87245 0 13.1165C0 20.3605 5.87245 26.233 13.1165 26.233Z"
                            fill="#039BE5" />
                        <path
                            d="M6.00188 12.8323L18.6484 7.95623C19.2353 7.74418 19.748 8.09942 19.5578 8.98697L19.5589 8.98587L17.4056 19.1304C17.246 19.8496 16.8186 20.0245 16.2207 19.6856L12.9416 17.2689L11.36 18.7926C11.1851 18.9675 11.0375 19.1151 10.6987 19.1151L10.9315 15.778L17.0088 10.2877C17.2733 10.0549 16.9498 9.9237 16.6011 10.1554L9.09082 14.8839L5.85323 13.874C5.15041 13.651 5.1351 13.1711 6.00188 12.8323Z"
                            fill="white" />
                    </svg>

                </a>


            </div>

            <div x-data="{ open: false }" class="relative text-[14px] py-4 ">

                <!-- Current Language Button -->
                <button @click="open = !open" class="w-full flex items-center justify-end gap-1 text-white px-4">
                    <svg class="w-6 h-6" viewBox="0 0 17 17" version="1.1" xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink" fill="#00">
                        <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                        <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                        <g id="SVGRepo_iconCarrier">
                            <path
                                d="M8.516 0c-4.687 0-8.5 3.813-8.5 8.5s3.813 8.5 8.5 8.5 8.5-3.813 8.5-8.5-3.814-8.5-8.5-8.5zM1.041 9h2.937c0.044 1.024 0.211 2.031 0.513 3h-2.603c-0.481-0.906-0.776-1.923-0.847-3zM3.978 8h-2.937c0.071-1.077 0.366-2.094 0.847-3h2.6c-0.301 0.969-0.467 1.976-0.51 3zM5.547 5h5.896c0.33 0.965 0.522 1.972 0.569 3h-7.034c0.046-1.028 0.239-2.035 0.569-3zM4.978 9h7.035c-0.049 1.028-0.241 2.035-0.572 3h-5.891c-0.331-0.965-0.524-1.972-0.572-3zM13.013 9h2.978c-0.071 1.077-0.366 2.094-0.847 3h-2.644c0.302-0.969 0.469-1.976 0.513-3zM13.013 8c-0.043-1.024-0.209-2.031-0.51-3h2.641c0.48 0.906 0.775 1.923 0.847 3h-2.978zM14.502 4h-2.354c-0.392-0.955-0.916-1.858-1.55-2.7 1.578 0.457 2.938 1.42 3.904 2.7zM9.074 1.028c0.824 0.897 1.484 1.9 1.972 2.972h-5.102c0.487-1.071 1.146-2.073 1.97-2.97 0.199-0.015 0.398-0.030 0.602-0.030 0.188 0 0.373 0.015 0.558 0.028zM6.383 1.313c-0.629 0.838-1.151 1.737-1.54 2.687h-2.314c0.955-1.267 2.297-2.224 3.854-2.687zM2.529 13h2.317c0.391 0.951 0.915 1.851 1.547 2.689-1.561-0.461-2.907-1.419-3.864-2.689zM7.926 15.97c-0.826-0.897-1.488-1.899-1.978-2.97h5.094c-0.49 1.072-1.152 2.075-1.979 2.972-0.181 0.013-0.363 0.028-0.547 0.028-0.2 0-0.395-0.015-0.59-0.030zM10.587 15.703c0.636-0.842 1.164-1.747 1.557-2.703h2.358c-0.968 1.283-2.332 2.247-3.915 2.703z"
                                fill="#00"></path>
                        </g>
                    </svg>

                    <svg class="w-3 h-3 transition-transform duration-300" :class="{ 'rotate-180': open }"
                        viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                        <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                        <g id="SVGRepo_iconCarrier">
                            <path
                                d="M17.9188 8.17969H11.6888H6.07877C5.11877 8.17969 4.63877 9.33969 5.31877 10.0197L10.4988 15.1997C11.3288 16.0297 12.6788 16.0297 13.5088 15.1997L15.4788 13.2297L18.6888 10.0197C19.3588 9.33969 18.8788 8.17969 17.9188 8.17969Z"
                                fill="#000"></path>
                        </g>
                    </svg>
                </button>

                <!-- Dropdown -->
                <div x-show="open" @click.away="open = false" x-transition:enter="transition ease-out duration-200"
                    x-transition:enter-start="opacity-0 translate-y-2 scale-95"
                    x-transition:enter-end="opacity-100 translate-y-0 scale-100"
                    x-transition:leave="transition ease-in duration-150"
                    x-transition:leave-start="opacity-100 translate-y-0 scale-100"
                    x-transition:leave-end="opacity-0 translate-y-2 scale-95"
                    class="absolute right-0 mt-2 w-44 bg-white rounded shadow-lg py-2 z-50" style="display: none;">

                    @if ($locale !== 'en')
                    <a href="{{ route('lang.switch', 'en') }}"
                        class="flex items-center gap-2 px-3 py-2 hover:bg-red-500 hover:text-white">
                        <img src="{{ asset('assets/images/icons/usa-flag.png') }}" class="w-5 h-5 rounded-full">
                        <span>
                            {{ $locale === 'km' ? 'ភាសាអង់គ្លេស' : ($locale === 'cn' ? '英语' : 'English') }}
                        </span>
                    </a>
                    @endif

                    <!-- KM -->
                    @if ($locale !== 'km')
                    <a href="{{ route('lang.switch', 'km') }}"
                        class="flex items-center gap-2 px-3 py-2 hover:bg-red-500 hover:text-white">
                        <img src="{{ asset('assets/images/icons/kh-flag.png') }}" class="w-5 h-5 rounded-full">
                        <span>
                            {{ $locale === 'en' ? 'Khmer' : ($locale === 'cn' ? '高棉语' : 'ភាសាខ្មែរ') }}
                        </span>
                    </a>
                    @endif

                    <!-- CN -->
                    @if ($locale !== 'ch')
                    <a href="{{ route('lang.switch', 'ch') }}"
                        class="flex items-center gap-2 px-3 py-2 hover:bg-red-500 hover:text-white">
                        <img src="{{ asset('assets/images/icons/ch-flag.png') }}" class="w-5 h-5 rounded-full">
                        <span>
                            {{ $locale === 'en' ? 'Chinese' : ($locale === 'km' ? 'ចិន' : '中文') }}
                        </span>
                    </a>
                    @endif
                </div>
            </div>
        </div>

        <div class="lg:hidden flex items-center">
            <button @click="open = true" class="flex items-center p-2 rounded-md bg-gray-200 hover:bg-gray-300">
                <!-- Hamburger Icon -->
                <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5"
                    stroke="currentColor" class="w-6 h-6">
                    <path stroke-linecap="round" stroke-linejoin="round"
                        d="M3.75 5.75h16.5M3.75 12h16.5M3.75 18.25h16.5" />
                </svg>
            </button>

            <div x-data="{ open: false }" class="relative text-[14px] py-4 ">

                <!-- Current Language Button -->
                <button @click="open = !open" class="w-full flex items-center justify-end gap-1 text-white ps-4">
                    <svg class="w-6 h-6" viewBox="0 0 17 17" version="1.1" xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink" fill="#00">
                        <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                        <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                        <g id="SVGRepo_iconCarrier">
                            <path
                                d="M8.516 0c-4.687 0-8.5 3.813-8.5 8.5s3.813 8.5 8.5 8.5 8.5-3.813 8.5-8.5-3.814-8.5-8.5-8.5zM1.041 9h2.937c0.044 1.024 0.211 2.031 0.513 3h-2.603c-0.481-0.906-0.776-1.923-0.847-3zM3.978 8h-2.937c0.071-1.077 0.366-2.094 0.847-3h2.6c-0.301 0.969-0.467 1.976-0.51 3zM5.547 5h5.896c0.33 0.965 0.522 1.972 0.569 3h-7.034c0.046-1.028 0.239-2.035 0.569-3zM4.978 9h7.035c-0.049 1.028-0.241 2.035-0.572 3h-5.891c-0.331-0.965-0.524-1.972-0.572-3zM13.013 9h2.978c-0.071 1.077-0.366 2.094-0.847 3h-2.644c0.302-0.969 0.469-1.976 0.513-3zM13.013 8c-0.043-1.024-0.209-2.031-0.51-3h2.641c0.48 0.906 0.775 1.923 0.847 3h-2.978zM14.502 4h-2.354c-0.392-0.955-0.916-1.858-1.55-2.7 1.578 0.457 2.938 1.42 3.904 2.7zM9.074 1.028c0.824 0.897 1.484 1.9 1.972 2.972h-5.102c0.487-1.071 1.146-2.073 1.97-2.97 0.199-0.015 0.398-0.030 0.602-0.030 0.188 0 0.373 0.015 0.558 0.028zM6.383 1.313c-0.629 0.838-1.151 1.737-1.54 2.687h-2.314c0.955-1.267 2.297-2.224 3.854-2.687zM2.529 13h2.317c0.391 0.951 0.915 1.851 1.547 2.689-1.561-0.461-2.907-1.419-3.864-2.689zM7.926 15.97c-0.826-0.897-1.488-1.899-1.978-2.97h5.094c-0.49 1.072-1.152 2.075-1.979 2.972-0.181 0.013-0.363 0.028-0.547 0.028-0.2 0-0.395-0.015-0.59-0.030zM10.587 15.703c0.636-0.842 1.164-1.747 1.557-2.703h2.358c-0.968 1.283-2.332 2.247-3.915 2.703z"
                                fill="#00"></path>
                        </g>
                    </svg>

                    <svg class="w-3 h-3 transition-transform duration-300" :class="{ 'rotate-180': open }"
                        viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                        <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                        <g id="SVGRepo_iconCarrier">
                            <path
                                d="M17.9188 8.17969H11.6888H6.07877C5.11877 8.17969 4.63877 9.33969 5.31877 10.0197L10.4988 15.1997C11.3288 16.0297 12.6788 16.0297 13.5088 15.1997L15.4788 13.2297L18.6888 10.0197C19.3588 9.33969 18.8788 8.17969 17.9188 8.17969Z"
                                fill="#000"></path>
                        </g>
                    </svg>
                </button>

                <!-- Dropdown -->
                <div x-show="open" @click.away="open = false" x-transition:enter="transition ease-out duration-200"
                    x-transition:enter-start="opacity-0 translate-y-2 scale-95"
                    x-transition:enter-end="opacity-100 translate-y-0 scale-100"
                    x-transition:leave="transition ease-in duration-150"
                    x-transition:leave-start="opacity-100 translate-y-0 scale-100"
                    x-transition:leave-end="opacity-0 translate-y-2 scale-95"
                    class="absolute right-0 mt-2 w-44 bg-white rounded shadow-lg py-2 z-50" style="display: none;">

                    @if ($locale !== 'en')
                    <a href="{{ route('lang.switch', 'en') }}"
                        class="flex items-center gap-2 px-3 py-2 hover:bg-red-500 hover:text-white">
                        <img src="{{ asset('assets/images/icons/usa-flag.png') }}" class="w-5 h-5 rounded-full">
                        <span>
                            {{ $locale === 'km' ? 'ភាសាអង់គ្លេស' : ($locale === 'cn' ? '英语' : 'English') }}
                        </span>
                    </a>
                    @endif

                    <!-- KM -->
                    @if ($locale !== 'km')
                    <a href="{{ route('lang.switch', 'km') }}"
                        class="flex items-center gap-2 px-3 py-2 hover:bg-red-500 hover:text-white">
                        <img src="{{ asset('assets/images/icons/kh-flag.png') }}" class="w-5 h-5 rounded-full">
                        <span>
                            {{ $locale === 'en' ? 'Khmer' : ($locale === 'cn' ? '高棉语' : 'ភាសាខ្មែរ') }}
                        </span>
                    </a>
                    @endif

                    <!-- CN -->
                    @if ($locale !== 'ch')
                    <a href="{{ route('lang.switch', 'ch') }}"
                        class="flex items-center gap-2 px-3 py-2 hover:bg-red-500 hover:text-white">
                        <img src="{{ asset('assets/images/icons/ch-flag.png') }}" class="w-5 h-5 rounded-full">
                        <span>
                            {{ $locale === 'en' ? 'Chinese' : ($locale === 'km' ? 'ចិន' : '中文') }}
                        </span>
                    </a>
                    @endif
                </div>
            </div>

        </div>

        <div x-show="open" x-cloak x-transition:enter="transform transition ease-out duration-300"
            x-transition:enter-start="translate-x-full" x-transition:enter-end="translate-x-0"
            x-transition:leave="transform transition ease-in duration-200" x-transition:leave-start="translate-x-0"
            x-transition:leave-end="translate-x-full"
            class="fixed inset-y-0 right-0 w-full md:w-64 bg-white shadow-xl z-50 ">
            <div class="flex justify-between items-center px-4 py-2">
                <img src="{{ asset('assets/images/logo.png') }}" alt="" class="w-10">
                <button @click="open = false" class="text-2xl">&times;</button>
            </div>

            <hr class="h-1 m-0" style="background: linear-gradient(90deg, #8DC640 0%, #059848 100%);">

            <ul class="space-y-2 p-4 uppercase">
                <li>
                    <a href="{{ route('home') }}"
                        class="block p-2 hover:bg-gray-100 rounded text-[#1E1E1E] no-underline {{ Route::is('home') ? 'bg-[#059848] text-[#fff]' : '' }}">
                        {{ app()->getLocale() === 'en' ? 'Home' : (app()->getLocale() === 'km' ? 'ទំព័រដើម' : '住宅') }}

                    </a>
                </li>
                <li>
                    <a href="{{ route('about') }}"
                        class="block p-2 hover:bg-gray-100 rounded text-[#1E1E1E] no-underline {{ Route::is('about') ? 'bg-[#059848] text-[#fff]' : '' }}">
                        {{ app()->getLocale() === 'en' ? 'About Us' : (app()->getLocale() === 'km' ? 'អំពីយើងខ្ញុំ' : '公司简介') }}
                    </a>
                </li>
                <li>
                    <a href="{{  route('our_product')}}"
                        class="block p-2 hover:bg-gray-100 rounded text-[#1E1E1E] no-underline {{ Route::is('our_product') ? 'bg-[#059848] text-[#fff]' : '' }}">
                        {{ app()->getLocale() === 'en' ? 'Our Products' : (app()->getLocale() === 'km' ? 'ផលិតផលរបស់យើងខ្ញុំ' : '我们的产品') }}
                    </a>
                </li>

                <li>
                    <a href="{{ route('events') }}"
                        class="block p-2 hover:bg-gray-100 rounded text-[#1E1E1E] no-underline {{ Route::is('events') ? 'bg-[#059848] text-[#fff]' : '' }}">
                        {{ app()->getLocale() === 'en' ? 'our Activities' : (app()->getLocale() === 'km' ? 'សកម្មភាព' : '商业活动') }}
                    </a>
                </li>
                <li>
                    <a href="{{ route('career') }}"
                        class="block p-2 hover:bg-gray-100 rounded text-[#1E1E1E] no-underline {{ Route::is('career') ? 'bg-[#059848] text-[#fff]' : '' }}">
                        {{ app()->getLocale() === 'en' ? 'Career' : (app()->getLocale() === 'km' ? 'ឱកាសការងារ' : '就业机会') }}
                    </a>
                </li>
                <li>
                    <a href="{{ route('contact') }}"
                        class="block p-2 hover:bg-gray-100 rounded text-[#1E1E1E] no-underline {{ Route::is('contact') ? 'bg-[#059848] text-[#fff]' : '' }}">
                        {{ app()->getLocale() === 'en' ? 'Contact us' : (app()->getLocale() === 'km' ? 'ការទំនាក់ទំនង' : '联系方法') }}
                    </a>
                </li>
            </ul>

            <div class="absolute left-0 bottom-2 space-y-2 px-6">
                <div class="flex flex-col gap-2">
                    <a href="#" class="flex items-center gap-2 text-[12px] text-[#1E1E1E] no-underline">
                        <svg width="14" height="15" viewBox="0 0 14 15" fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M6.56687 10.6981C6.62635 10.8591 6.60873 11.0417 6.52005 11.1853C6.43082 11.3295 6.28266 11.4155 6.12349 11.4155H4.94978H3.77553C3.61635 11.4155 3.46819 11.3289 3.37897 11.1853C3.29029 11.0417 3.27267 10.8591 3.33215 10.6981C3.53429 10.1525 3.92314 9.62795 4.48823 9.14067L4.65347 8.99827C4.82751 8.84805 5.07481 8.84865 5.24831 8.99947L5.41023 9.14067C5.97588 9.63096 6.36528 10.1549 6.56687 10.6981ZM9.2822 12.0307C8.90712 11.7477 8.39269 11.8487 8.13273 12.2591C7.99007 12.4838 7.75654 12.6172 7.50759 12.6172H2.40574C2.18488 12.6172 1.97504 12.5114 1.82963 12.3282C1.74867 12.2248 1.61758 12.0055 1.65999 11.6985C1.8456 10.3502 2.62165 9.07818 3.96665 7.91674C4.16438 7.7455 4.28004 7.48534 4.28004 7.21015C4.28004 6.93496 4.16438 6.67419 3.96665 6.50355C2.62165 5.34212 1.84505 4.06953 1.65999 2.72123C1.61758 2.4142 1.74812 2.19549 1.82963 2.09215C1.97504 1.90829 2.18488 1.80314 2.40574 1.80314H7.50814C7.72846 1.80314 7.9383 1.90769 8.08316 2.09094C8.38058 2.46707 8.90161 2.50973 9.24805 2.18468C9.59394 1.85962 9.63194 1.29062 9.33397 0.913286C8.87517 0.332869 8.20928 8.09101e-07 7.50814 8.09101e-07H2.40574C1.7035 -0.000600037 1.03706 0.33347 0.577714 0.915089C0.124975 1.4889 -0.0766099 2.24476 0.0263855 2.98861C0.236782 4.51596 0.96491 5.93215 2.19424 7.20955C0.96491 8.48695 0.236782 9.90314 0.0263855 11.4305C-0.0766099 12.1743 0.124975 12.9302 0.577714 13.504C1.03706 14.0862 1.7035 14.4197 2.40574 14.4197H7.50814C8.29961 14.4197 9.04096 13.9955 9.49204 13.2847C9.75201 12.8755 9.65783 12.3137 9.2822 12.0307ZM13.2181 7.20955C13.2181 9.20075 11.7387 10.8146 9.91339 10.8146C8.08811 10.8146 6.60872 9.20075 6.60872 7.20955C6.60872 5.21835 8.08811 3.60447 9.91339 3.60447C11.7387 3.60447 13.2181 5.21835 13.2181 7.20955ZM11.2903 7.86207L10.4642 6.9608V5.40701C10.4642 5.07534 10.2174 4.80617 9.91339 4.80617C9.60936 4.80617 9.36261 5.07534 9.36261 5.40701V6.9608C9.36261 7.27925 9.47883 7.58508 9.68537 7.81039L10.5115 8.71166C10.7269 8.94599 11.0755 8.94599 11.2903 8.71166C11.5057 8.47673 11.5057 8.0964 11.2903 7.86207Z"
                                fill="#109A49" />
                        </svg>
                        <span>
                            {{ app()->getLocale() === 'en' ? 'Monday - Friday 8am - 5pm' : (app()->getLocale() === 'km' ? 'ច័ន្ទ សុក្រ ៨ព្រឹក ៥ល្ងាច' : '星期一至五 8am - 5pm') }}<br>
                            {{ app()->getLocale() === 'en' ? 'Saturday 8am - 12pm' : (app()->getLocale() === 'km' ? 'ថ្ងៃសៅរ៍ ម៉ោង៨ព្រឹក ដល់ម៉ោង១២រសៀល' : '星期一至五 8am - 5pm') }}
                        </span>
                    </a>
                    <a href="https://mail.google.com/mail/?view=cm&fs=1&to=info@rsltrading.com" target="_blank" class="flex items-center gap-2 text-[12px] text-[#1E1E1E] no-underline">
                        <svg width="16" height="15" viewBox="0 0 16 15" fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M12.0414 0H3.57989C2.63076 0.00104095 1.7208 0.381179 1.04967 1.05701C0.378532 1.73284 0.00103372 2.64916 0 3.60492L0 10.8148C0.00103372 11.7705 0.378532 12.6869 1.04967 13.3627C1.7208 14.0385 2.63076 14.4187 3.57989 14.4197H12.0414C12.9906 14.4187 13.9005 14.0385 14.5717 13.3627C15.2428 12.6869 15.6203 11.7705 15.6213 10.8148V3.60492C15.6203 2.64916 15.2428 1.73284 14.5717 1.05701C13.9005 0.381179 12.9906 0.00104095 12.0414 0ZM12.0414 1.96632C12.4362 1.96765 12.8167 2.11481 13.1109 2.3799L8.88008 6.64027C8.59272 6.91664 8.21064 7.07086 7.81327 7.07086C7.4159 7.07086 7.03382 6.91664 6.74646 6.64027L2.51569 2.3799C2.80849 2.11601 3.18695 1.96892 3.57989 1.96632H12.0414ZM12.0414 12.4534H3.57989C3.14832 12.4534 2.73443 12.2807 2.42927 11.9734C2.12411 11.6661 1.95267 11.2494 1.95267 10.8148V4.59923L5.36268 8.03308C5.68406 8.35685 6.06564 8.61369 6.48562 8.78892C6.90559 8.96415 7.35574 9.05434 7.81034 9.05434C8.26494 9.05434 8.71509 8.96415 9.13507 8.78892C9.55505 8.61369 9.93663 8.35685 10.258 8.03308L13.6687 4.59923V10.8148C13.6687 11.2494 13.4972 11.6661 13.1921 11.9734C12.8869 12.2807 12.473 12.4534 12.0414 12.4534Z"
                                fill="#109A49" />
                        </svg>

                        <span>{{ app()->getLocale() === 'en' ? 'info@rsltrading.com' : (app()->getLocale() === 'km' ? 'អ៉ីមែល៖ info@rsltrading.com' : 'info@rsltrading.com') }}</span>
                    </a>
                    <a href="#" class="flex items-center gap-2 text-[12px] text-[#1E1E1E] no-underline">
                        <svg width="15" height="15" viewBox="0 0 16 16" fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M14.4232 1.25362L13.7134 0.63544C12.8213 -0.2235 11.3953 -0.216993 10.4902 0.687497L9.14229 2.14509C8.71253 2.57456 8.4716 3.14719 8.4716 3.75886C8.4716 4.37053 8.70601 4.93665 9.13578 5.36612L9.39624 5.6264C8.56927 7.37031 7.33207 8.60666 5.64556 9.38751L5.37859 9.12723C4.94882 8.69776 4.3758 8.4635 3.77022 8.4635C3.16464 8.4635 2.59162 8.69776 2.18139 9.10771L0.670695 10.5067C0.240929 10.9362 0 11.5088 0 12.1205C0 12.7322 0.227906 13.2788 0.638137 13.7017C0.638137 13.7017 1.24372 14.398 1.25674 14.411C2.03813 15.1919 3.09301 15.6213 4.22603 15.6213C9.12276 15.6213 15.6213 9.12723 15.6213 4.23388C15.6213 3.10164 15.1916 2.04748 14.4102 1.26663L14.4232 1.25362ZM4.23905 13.6562C3.63999 13.6562 3.07999 13.4349 2.66976 13.038C2.66976 13.038 2.07069 12.3483 2.05116 12.3352C1.9665 12.2506 1.95348 12.153 1.95348 12.1075C1.95348 12.0619 1.9665 11.9578 2.02511 11.9058L3.5358 10.5067C3.62045 10.4221 3.71813 10.4091 3.76371 10.4091C3.80929 10.4091 3.91347 10.4221 3.99161 10.5067L4.72742 11.2355C5.00091 11.5023 5.40463 11.5869 5.76277 11.4503C8.43253 10.4352 10.3469 8.52207 11.4474 5.77606C11.5907 5.41817 11.5125 5.00172 11.239 4.72842L10.5097 3.98661C10.4251 3.90201 10.4121 3.80441 10.4121 3.75886C10.4121 3.71331 10.4251 3.60919 10.5358 3.50508L11.8837 2.04748C12.0139 1.92385 12.2158 1.92385 12.346 2.04748C12.359 2.0605 13.0493 2.66566 13.0493 2.66566C13.4465 3.07561 13.6679 3.62871 13.6679 4.23388C13.6679 8.39843 7.81392 13.6692 4.22603 13.6692L4.23905 13.6562Z"
                                fill="#109A49" />
                        </svg>

                        <span>{{ app()->getLocale() === 'en' ? '+855 11 678 588' : (app()->getLocale() === 'km' ? 'លេខទូរស័ព្ទ៖ +៨៥៥ ១១ ៦៧៨ ៥៨៨' : '+855 11 678 588') }}</span>
                    </a>
                </div>

                <div class="flex items-center gap-2">
                    <a href="https://www.facebook.com/rsltradingcambodia" target="_blank" class="">
                        <svg width="27" height="27" viewBox="0 0 27 27" fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M13.1165 0C5.88409 0 0 5.88409 0 13.1165C0 20.3484 5.88409 26.233 13.1165 26.233C20.3484 26.233 26.233 20.3484 26.233 13.1165C26.233 5.88409 20.3494 0 13.1165 0ZM16.3784 13.5783H14.2445V21.1842H11.0824C11.0824 21.1842 11.0824 17.0283 11.0824 13.5783H9.57928V10.8901H11.0824V9.15132C11.0824 7.90603 11.6741 5.96017 14.2736 5.96017L16.6167 5.96915V8.57861C16.6167 8.57861 15.1929 8.57861 14.916 8.57861C14.6392 8.57861 14.2455 8.71703 14.2455 9.31088V10.8906H16.6548L16.3784 13.5783Z"
                                fill="#007BFF" />
                        </svg>
                    </a>
                    <a href="https://t.me/+85511678588" target="_blank">
                        <svg width="27" height="27" viewBox="0 0 27 27" fill="none"
                            xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M13.1165 26.233C20.3605 26.233 26.233 20.3605 26.233 13.1165C26.233 5.87245 20.3605 0 13.1165 0C5.87245 0 0 5.87245 0 13.1165C0 20.3605 5.87245 26.233 13.1165 26.233Z"
                                fill="#039BE5" />
                            <path
                                d="M6.00188 12.8323L18.6484 7.95623C19.2353 7.74418 19.748 8.09942 19.5578 8.98697L19.5589 8.98587L17.4056 19.1304C17.246 19.8496 16.8186 20.0245 16.2207 19.6856L12.9416 17.2689L11.36 18.7926C11.1851 18.9675 11.0375 19.1151 10.6987 19.1151L10.9315 15.778L17.0088 10.2877C17.2733 10.0549 16.9498 9.9237 16.6011 10.1554L9.09082 14.8839L5.85323 13.874C5.15041 13.651 5.1351 13.1711 6.00188 12.8323Z"
                                fill="white" />
                        </svg>

                    </a>


                </div>
            </div>
        </div>

    </div>
    <div class="w-full h-[20px]" style="background: linear-gradient(90deg, #8DC640 0%, #059848 100%);"></div>
</section>