<?php

return [
    "q" => '问:',

    "q1" => "RSL 交易公司出口哪些柬埔寨产品？",
    "a1" => "答：RSL 贸易公司出口优质的柬埔寨农产品和天然产品，包括大米、咖啡豆、玉米、腰果、芒果、木薯、胡椒、木炭以​植物等。所有产品均直接来自柬埔寨各地的农民和生产商，以确保其品质、可追溯性和可持续供应。",
    
    "q2" => "出口的最小起订量是多少？",
    "a2" => "答：目前我们的主要市场包括美国、欧盟、新西兰、日本、新加坡、中国、韩国、希腊、非洲、越南、马来西亚、卡塔尔、印度、孟加拉国、香港、台湾以及俄罗斯。",
    
    "q3" => "你们出口到哪些国家？",
    "a3" => "答：我们目前向国际市场出口产品，包括俄罗斯、韩国、印度、孟加拉国、泰国、马来西亚、越南、中国、台湾、香港、非洲等地，并且正在全球范围内拓展业务，以便将柬埔寨的农产品推向澳大利亚和加拿大等潜在市场。",
    
    "q4"=> "RSL 交易公司是如何确保产品品质并保证安全交付的？",
    "a4"=> "答：通过与国际知名的质量保证公司或由买家指定的检查员紧密合作，我们对所有柬埔寨产品进行精心采购、严格检验和妥善包装，确保其符合国际标准。此外，我们以专业态度管理货物装卸、运输和出口文件工作，并借助拥有超过 15 年行业经验的物流合作伙伴的支持，以确保实现全球范围内的顺畅、可靠交付。",
    
    "q5" => "RSL 贸易公司可以为买家提供定制包装或标签吗？",
    "a5" => "答：我们可以适应定制包装和标签，以满足国际买家的要求。",
    
    "q6" => "如何从RSL贸易公司订购柬埔寨农产品？",
    "a6" => "答：买家可以通过我们的网站、电话或电子邮件联系金边的RSL贸易公司。我们的团队将指导您完成产品选择、定价、运输和海关文件。",

    
    "q7" => "本地农民如何向RSL贸易公司供应产品？",
    "a7" => "答：柬埔寨各地的农民可以与RSL贸易公司合作，出口大米、咖啡、玉米、水果和其他作物。我们在质量标准、收获和包装方面为农民提供指导，以满足出口要求。",
    
    "q8" => "RSL交易如何确保农民公平定价?",
    "a8" => "答：我们帮助农民进入全球市场，提供公平和透明的定价，并就农业最佳实践和质量改进提供指导。",
    
    "q9" => "与农民之间有签订合同或达成协议吗？",
    "a9" => "答：是的。我们会签订协议来明确产品质量、交货时间表以及价格，以确保双方的利益得到保障并做到公开透明。",
    
    "q10" => "有哪些類型的農產品可以出口？",
    "a10" => "答：我们评估当地和国际市场价格，并提供有竞争力、透明的费率，帮助柬埔寨农民获得可持续的收入。",
    
    "q11" => "是否与农民签订了合同或协议？",
    "a11" => "答：RSL贸易公司与大米、咖啡、玉米、腰果、芒果、木薯和其他符合国际质量标准的农产品合作。",
];