<?php

return [
    "q" => 'សំណួរ៖',
    "q1" => "១. តើ​​ ក្រុមហ៊ុន  អ អេស អិល ត្រេឌីង ឯ.ក នាំចេញផលិតផលអ្វីខ្លះ?",
    "a1" => "ចម្លើយ៖​​ ក្រុមហ៊ុន  អ អេស អិល ត្រេឌីង​ នាំចេញផលិតផលកសិកម្មជាចម្បងរួមមាន អង្ករ គ្រាប់កាហ្វេ ពោត គ្រាប់ស្វាយចន្ទី ស្វាយ ដំណាប់ស្វាយ និងដំឡូងមី។ ផលិតផលទាំងអស់ត្រូវបានទទួលដោយផ្ទាល់ពីកសិករ ឬសហគមន៍ក្នុងប្រទេសកម្ពុជា។",
    
    "q2" => "២. តើបរិមាណបញ្ជាទិញជាអប្បបរមា សម្រាប់ការនាំចេញមានប៉ុន្មាន?",
    "a2" => "ចម្លើយ៖ បរិមាណបញ្ជាទិញអប្បបរមាមានការប្រែប្រួលអាស្រ័យលើផលិតផល និងគោលដៅនាំចេញ។ សូមទាក់ទងមកកាន់ក្រុមការងាររបស់យើងខ្ញុំសម្រាប់ព័ត៌មានលម្អិតផ្អែកតាមតម្រូវការនាំចេញរបស់លោកអ្នក។",
    
    "q3" => "៣. តើ​​ ក្រុមហ៊ុន  អ អេស អិល ត្រេឌីង ឯ.ក បាននាំចេញទៅប្រទេសណាខ្លះ?",
    "a3" => "ចម្លើយ៖ បច្ចុប្បន្ន ទីផ្សារចម្បងរបស់យើងខ្ញុំគឺសហរដ្ឋអាមេរិក សហភាពអឺរ៉ុប នូវែលសេឡង់ ជប៉ុន សិង្ហបុរី ចិន កូរ៉េខាងត្បូង ក្រិក អាហ្វ្រិក វៀតណាម ម៉ាឡេស៊ី កាតា ឥណ្ឌា បង់ក្លាដែស ហុងកុង តៃវ៉ាន់ និងរុស្ស៊ី។",
    
    "q4"=> "៤. តើ ​ ក្រុមហ៊ុន អ អេស អិល ត្រេឌីង ឯ.ក ធានាគុណភាពផលិតផល និងការដឹកជញ្ជូនប្រកបដោយសុវត្ថិភាពយ៉ាងដូចម្តេច?",
    "a4"=> "ចម្លើយ៖ យើងខ្ញុំធ្វើការយ៉ាងជិតស្និទ្ធជាមួយក្រុមហ៊ុនពិនិត្យគុណភាពទទួលស្គាល់ជាអន្តរជាតិ ឬអ្នកជំនាញត្រួតពិនិត្យពីខាងអ្នកទិញ ។
    ផលិតផលកម្ពុជាទាំងអស់មានប្រភពច្បាស់លាស់ ត្រួតពិនិត្យត្រឹមត្រូវ និងវេចខ្ចប់ដោយប្រុងប្រយ័ត្នស្របតាមស្តង់ដារអន្តរជាតិ។ លើសពីនេះ យើងខ្ញុំគ្រប់គ្រងការដោះស្រាយទំនិញ ការដឹកជញ្ជូន និងរៀបចំឯកសារនាំចេញប្រកបដោយវិជ្ជាជីវៈ ។ យើងខ្ញុំមានដៃគូភស្តុភារកម្ម
    ដែលមានបទពិសោធន៍ជាង 15 ឆ្នាំក្នុងវិស័យនេះ ដើម្បីធានាបាននូវការដឹកជញ្ជូនទូទាំងពិភពលោកដោយរលូន និងអាចទុកចិត្តបាន។
    ",
   
    "q5" => "៥. តើក្រុមហ៊ុន អ អេស អិល ត្រេឌីង ឯ.ក អាចផ្តល់ការវេចខ្ចប់ឬស្លាកសញ្ញាតាមតម្រូវការសម្រាប់អ្នកទិញបានទេ?",
    "a5" => "ចម្លើយ៖ បាទ/ចាស៎។ យើងខ្ញុំអាចផ្តល់ការវេចខ្ចប់ និងស្លាកសញ្ញាតាមតម្រូវការ ដើម្បីបំពេញតាមតម្រូវការរបស់អតិថិជនក្រៅស្រុក។",
    
    "q6" => "៦. តើខ្ញុំអាចបញ្ជាទិញផលិតផលកសិកម្មកម្ពុជាពីក្រុមហ៊ុនបានយ៉ាងដូចម្តេច?",
    "a6" => "ចម្លើយ៖ លោកអ្នកអាចទាក់ទងមកក្រុមហ៊ុនយើងខ្ញ៉ំមានទីស្នាក់ការនៅភ្នំពេញ តាមរយៈគេហទំព័រ លេខទូរសព្ទ ឬសារអេឡិចត្រូនិកបាន។ ក្រុមការងាររបស់យើងខ្ញុំនឹងណែនាំអ្នកអំពីជម្រើសនៃ​ ផលិតផល តារាងតម្លៃ ការដឹកជញ្ជូន និងឯកសារគយជាដើម។",
    
    "q7" => "១. តើកសិករក្នុងស្រុកអាចផ្គត់ផ្គង់ផលិតផលទៅឱ្យក្រុមហ៊ុនបានយ៉ាងដូចម្តេច?",
    "a7" => "ចម្លើយ៖ កសិករមកពីទូទាំងប្រទេសកម្ពុជាអាចសហការជាមួយក្រុមហ៊ុនយើងខ្ញ៉ំដើម្បីនាំចេញអង្ករ កាហ្វេ ពោត ផ្លែឈើ និងដំណាំហូបផ្លែផ្សេងៗទៀត។",
    
    "q8" => "២. តើមានកិច្ចសន្យា ឬកិច្ចព្រមព្រៀងជាមួយកសិករដែរឬទេ?",
    "a8" => "ចម្លើយ៖ បាទ/ចាស៎។ យើងខ្ញុំបង្កើតកិច្ចព្រមព្រៀងដើម្បីបញ្ជាក់ពីគុណភាពផលិតផល កាលវិភាគដឹកជញ្ជូន និងតម្លៃ ដើម្បីធានាសុវត្ថិភាព និងតម្លាភាពសម្រាប់ភាគីទាំងពីរ។",
    
    "q9" => "៣. តើក្រុមហ៊ុនបានជួយអ្វីខ្លះដល់កសិករ?",
    "a9" => "ចម្លើយ៖ យើងខ្ញុំជួយកសិករឱ្យចូលទៅកាន់ទីផ្សារសកល ផ្តល់តម្លៃសមរម្យ មានតម្លាភាព និងផ្តល់ការណែនាំអំពីការអនុលោមនានា និងការកែលម្អគុណភាព។",
    
    "q10" => "៤. តើ​ផលិតផល​កសិកម្មប្រភេទ​ណា​ខ្លះ​ដែល​​មានសម្រាប់​ការ​នាំចេញ?",
    "a10" => "ចម្លើយ៖ ក្រុមហ៊ុនយើងខ្ញ៉ំធ្វើការនាំចេញ អង្ករ កាហ្វេ ពោត គ្រាប់ស្វាយចន្ទី ស្វាយ ដំឡូងមី និងផលិតផលកសិកម្មផ្សេងទៀតដែលបំពេញតាមស្តង់ដាគុណភាពអន្តរជាតិ។",
    
    "q11" => "៥. តើមានកិច្ចសន្យា ឬកិច្ចព្រមព្រៀងជាមួយកសិករដែរឬទេ?",
    "a11" => "ចម្លើយ៖ បាទ/ចាស៎។ យើងខ្ញុំបង្កើតកិច្ចព្រមព្រៀងដើម្បីបញ្ជាក់ពីគុណភាពផលិតផល កាលវិភាគដឹកជញ្ជូន និងការកំណត់តម្លៃ ដោយធានាសុវត្ថិភាព និងតម្លាភាពសម្រាប់ភាគីទាំងពីរ។",
];